app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`book_id` = 1
---
      <i class="fas fa-heart" style="color: #e1306c"></i>
      <%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="far fa-heart" style="color: #e1306c"></i>
      <%= book.favorites.count %> いいね