app/views/book_comments/_comments.html.erb

<p>コメント件数：<%= book.book_comments.count %></p>
<% book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

  <%= book_comment.user.name %>
  <%= book_comment.created_at.strftime('%Y/%m/%d') %><%= book_comment.comment %>
---
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "あああ"], ["user_id", 1], ["book_id", 1], ["created_at", "2022-05-25 13:35:15.022478"], ["updated_at", "2022-05-25 13:35:15.022478"]]