app/views/books/index.html.erb

SELECT COUNT(*) FROM `books` WHERE `books`.`created_at` BETWEEN '2021-09-09 00:00:00' AND '2021-09-09 23:59:59'
---
        <td>
          <%= Book.all.where(created_at: (6 - i).day.ago.all_day).size %>
          <% book_datas << Book.all.where(created_at: (6 - i).day.ago.all_day).size %>