app/views/books/show.html.erb

      </td>
      <td>コメント件数：<%= @book.book_comments.count %></td>
---
SELECT `book_comments`.* FROM `book_comments` WHERE `book_comments`.`book_id` = 2
SELECT COUNT(*) FROM `book_comments` WHERE `book_comments`.`book_id` = 3

    <div class="form-group">
    <% @book.book_comments.each do |book_comment| %>
---
SELECT `book_comments`.* FROM `book_comments` WHERE `book_comments`.`book_id` = 3