app/controllers/books_controller.rb

  def index
    @user = current_user
    @books = Book.includes(:favorites).sort {|a,b| b.favorites.size <=> a.favorites.size }
---
SELECT COUNT(*) FROM `books` WHERE `books`.`created_at` BETWEEN '2021-09-09 00:00:00' AND '2021-09-09 23:59:59'
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`book_id` = 3 AND `favorites`.`created_at` >= '2021-09-03 00:00:00' AND `favorites`.`created_at` < '2021-09-09 23:59:59'
SELECT `books`.* FROM `books`
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`book_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO `books` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('64e', '53wq5', 2, '2021-09-14 15:45:15', '2021-09-14 15:45:15')
SELECT `books`.* FROM `books`