app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "あああ"], ["user_id", 1], ["book_id", 1], ["created_at", "2022-05-25 13:35:15.022478"], ["updated_at", "2022-05-25 13:35:15.022478"]]
---
  def create
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.new
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT  `book_comments`.* FROM `book_comments` WHERE `book_comments`.`user_id` = 1 AND `book_comments`.`id` = 1 LIMIT 1
DELETE FROM `book_comments` WHERE `book_comments`.`id` = 1
---
  def destroy
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.new
    comment = current_user.book_comments.find(params[:id])
    comment.destroy