app/controllers/favorites_controller.rb

  def create
    book = Book.find(params[:book_id])
    favorite = current_user.favorites.new(book_id: book.id)
    favorite.save
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
INSERT INTO `favorites` (`user_id`, `book_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-09-09 07:41:43', '2021-09-09 07:41:43')

  def destroy
    book = Book.find(params[:book_id])
    favorite = current_user.favorites.find_by(book_id: book.id)
    favorite.destroy
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 1 AND `favorites`.`book_id` = 2 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 2