app/controllers/messages_controller.rb

  def create
    room = Room.find(params[:message][:room_id])
    @messages = room.messages
    message = Message.new(message_params)
    message.user_id = current_user.id
    if Entry.where(user_id: current_user.id, room_id: message.room_id).present? && message.message.length <= 140
      message.save
    else
      @room = room
      @messages = @room.messages
      @message = message
      @entries = @room.entries
      @opponent = @entries.where(room_id: @room.id).where.not(user_id: current_user).first.user
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 1 AND `entries`.`room_id` = 1
INSERT INTO `messages` (`user_id`, `room_id`, `message`, `created_at`, `updated_at`) VALUES (1, 1, 'ajax', '2021-09-11 16:34:05', '2021-09-11 16:34:05')
SELECT  `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1 LIMIT 11
SELECT  `entries`.* FROM `entries` WHERE `entries`.`room_id` = 1 AND `entries`.`room_id` = 1 AND `entries`.`user_id` != 1 ORDER BY `entries`.`id` ASC LIMIT 1