app/controllers/relationships_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def create
    current_user.follow(params[:id])
    user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def destroy
    current_user.unfollow(params[:id])
    user = User.find(params[:id])