app/controllers/rooms_controller.rb

INSERT INTO `rooms` (`created_at`, `updated_at`) VALUES ('2021-09-13 10:21:41', '2021-09-13 10:21:41')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (2, 1, '2021-09-11 12:57:50', '2021-09-11 12:57:50')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-09-13 10:21:42', '2021-09-13 10:21:42')
---
  def create
    @room = Room.create
    @entry1 = Entry.create(room_id: @room.id, user_id: current_user.id)
    @entry2 = @room.entries.create(room_params)

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 1 AND `entries`.`room_id` = 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1
SELECT  `entries`.* FROM `entries` WHERE `entries`.`room_id` = 1 AND `entries`.`room_id` = 1 AND `entries`.`user_id` != 1 ORDER BY `entries`.`id` ASC LIMIT 1
---
  def show
    @room = Room.find(params[:id])
    if Entry.where(user_id: current_user.id,room_id: @room.id).present?
      @messages = @room.messages
      @message = Message.new
      entries = @room.entries
      # DM相手のユーザーを取得
      @opponent = entries.where(room_id: @room.id).where.not(user_id: current_user).first.user

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT  `entries`.* FROM `entries` WHERE `entries`.`room_id` = 1 AND `entries`.`room_id` = 1 AND `entries`.`user_id` != 2 ORDER BY `entries`.`id` ASC LIMIT 1
---
  def is_mutural?
    room = Room.find(params[:id])
    user = room.entries.where(room_id: room.id).where.not(user_id: current_user).first.user