app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new

    ## DM機能
    @current_user_entry = Entry.where(user_id: current_user.id)
    @user_entry = Entry.where(user_id: @user.id)
    unless @user.id == current_user.id
      @current_user_entry.each do |cu|
        @user_entry.each do |u|
          if cu.room_id == u.room_id
            @is_room = true
            @room_id = cu.room_id
          end
        end
      end
      unless @is_room
        @room = Room.new
        @entry = Entry.new
      end
    end

    ## 投稿数
    today_begin = Time.current.at_beginning_of_day
    today_end = Time.current.at_end_of_day
    @today_amount = @books.created_today.size
    @yesterday_amount = @books.created_yesterday.size
    @this_week_amount = @books.created_this_week.size
    @last_week_amount = @books.created_last_week.size
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 1
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 2
SELECT COUNT(*) FROM `books` WHERE `books`.`user_id` = 1 AND `books`.`created_at` >= '2021-09-14 00:00:00' AND `books`.`created_at` < '2021-09-14 23:59:59'
SELECT COUNT(*) FROM `books` WHERE `books`.`user_id` = 2 AND `books`.`created_at` BETWEEN '2021-09-13 00:00:00' AND '2021-09-13 23:59:59'
SELECT COUNT(*) FROM `books` WHERE `books`.`user_id` = 2 AND `books`.`created_at` >= '2021-09-08 00:00:00' AND `books`.`created_at` < '2021-09-14 23:59:59'
SELECT  `books`.* FROM `books` WHERE `books`.`created_at` BETWEEN '2021-09-28 00:00:00' AND '2021-09-28 23:59:59' LIMIT 11
SELECT COUNT(*) FROM `books` WHERE `books`.`user_id` = 2 AND `books`.`created_at` >= '2021-09-01 00:00:00' AND `books`.`created_at` < '2021-09-07 23:59:59'

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `profile_image_id` = '76a4d0741ef6610462cb3605b9c6fb88498bbe960d2e86d02b92d4063881', `introduction` = '', `updated_at` = '2022-02-15 16:48:13' WHERE `users`.`id` = 1

  def following
    @title = "Follow Users"
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def followers
    @title = "Follower Users"
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1