app/models/user.rb

INSERT INTO `relationships` (`follower_id`, `followed_id`, `created_at`, `updated_at`) VALUES (1, 2, '2021-09-11 07:36:30', '2021-09-11 07:36:30')
---
  def follow(user_id)
    active_relationships.create(followed_id: user_id)

DELETE FROM `relationships` WHERE `relationships`.`id` = 1
---
  def unfollow(user_id)
    active_relationships.find_by(followed_id: user_id).destroy